// 2.Напишите метод, который определит тип (расширение) файлов из 
// текущей папки и выведет в консоль результат вида

// 1. Расширение файла: txt
// 2. Расширение файла: pdf
// 3. Расширение файла:
// 4. Расширение файла: jpg


private static void task2() {
        int[] arr = new int[]{1, 2, 1, 9, 11, 7, 81, 43, 1, 4};
        Arrays.sort(arr);
        System.out.println("минимальный элементы: " + arr[0]);
        System.out.println("максимальный элементы: " + arr[arr.length - 1]);

    }